"""
2. Создать csv файл с данными о ежедневной погоде.
Структура:  Дата, Место, Градусы, Скорость ветра.
Найти среднюю погоду(скорость ветра и градусы) для Минск за последние 7 дней.
"""

import csv_utils
import datetime

fields = ["Дата", "Место", "Температура", "Скорость ветра"]
data = [
    ["10-05-2020", "Минск", -5, 3],
    ["17-05-2020", "Брест", -12, 4],
    ["17-05-2020", "Витебск", -17, 1],
    ["17-05-2020", "Гродно", -4, 5],
    ["18-05-2020", "Минск", 0, 4],
    ["19-05-2020", "Минск", 4, 7],
    ["20-05-2020", "Витебск", 10, 12],
    ["20-05-2020", "Минск", 11, 10],
    ["21-05-2020", "Гродно", 21, 7],
    ["21-05-2020", "Минск", 22, 5],
    ["21-05-2020", "Брест", 17, 2],
    ["16-05-2020", "Минск", -5, 3],
    ["17-06-2020", "Брест", -12, 4],
    ["17-06-2020", "Витебск", -17, 1],
    ["17-06-2020", "Гродно", -4, 5],
    ["18-06-2020", "Минск", 0, 4],
    ["19-06-2020", "Минск", 4, 7],
    ["20-06-2020", "Витебск", 10, 12],
    ["20-06-2020", "Минск", 11, 10],
    ["21-06-2020", "Гродно", 21, 7],
    ["21-06-2020", "Минск", 22, 5],
    ["21-06-2020", "Брест", 17, 2],
]

csv_utils.csv_write('weather.csv', fields, data)
data = csv_utils.csv_read('weather.csv')


def statistic(data, region):
    now = datetime.date.today()
    average_temp = list()
    average_wind = list()
    for i in data[1:]:
        date = i[0].split('-')
        date = datetime.date(int(date[2]), int(date[1]), int(date[0]))
        if now - date < datetime.timedelta(days=7):
            if i[1] == region:
                average_temp.append(int(i[2]))
                average_wind.append(int(i[3]))

    return sum(average_temp) / len(average_temp), sum(average_wind) / len(average_wind)


print(f"Средняя температура в Минске за последние 7 дней: {statistic(data, 'Минск')[0]} \N{DEGREE SIGN}С")
print(f"Средняя скорость ветра в Минске за последние 7 дней: {statistic(data, 'Минск')[1]} м/с")
